app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      begin
        artist = Artist.find(params[:artist_id])
      rescue ActiveRecord::RecordNotFound => e
        artist = nil
      end

      if artist
        @songs = artist.songs
      else
        redirect_to artists_path, alert: "Artist not found"
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    if params[:artist_id]
      # begin
      #   artist = Artist.find(params[:artist_id])
      # rescue ActiveRecord::RecordNotFound => e
      #   artist = nil
      # end

      @artist = Artist.find(params[:artist_id])
      @song = @artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 12345]]